{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Logs\PILA estimations.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Jul 2025, 16:09:27
{txt}
{com}. 
. 
. ****************************************************************************
. **#             1. Prepare data
. ****************************************************************************
. 
. local replace replace
{txt}
{com}. 
.         
. use "${c -(}data{c )-}\mensual_PILA", clear
{txt}
{com}. 
. * Process raw data to create relevant variables
. quietly{c -(}
{txt}
{com}. 
. /*
> ****************************************************************************
> **#             2. Year by year RDD
> ****************************************************************************
> 
> forval year = 2009/2020 {c -(} // Loop through all years
> 
>     * First cohorts (M50 & F55) retire in 2010, so only one year before and after
>     if inrange(`year', 2009, 2011) {c -(}
>         
>         foreach cohort in $first_cohorts {c -(}
>         
>             foreach outcome in $outcomes {c -(}
>                 
>                 forval month = 1/12 {c -(}
>                     
>                     foreach runvar in std_weeks std_days {c -(}
>                         
>                     dis as err "Cohort: `cohort'; Outcome: `outcome'; Date: "        ///
>                     "`year'-`month'; Runvar: `runvar' -> (1) Year by year RDD"
>                     
>                     cap mat drop beta vari
>                     
>                     ** RDRobust estimation
>                     cap noi rdrobust `outcome' `runvar' if poblacion_`cohort' == 1 & ///
>                     fecha_pila == ym(`year',`month'), vce(hc3)
> 
>                     cap noi mat beta = e(tau_bc)            // Store robust beta
>                     cap noi mat vari = e(se_tau_rb)^2       // Store robust SE
> 
>                     * Save estimation results in dataset
>                     cap noi regsave using "${c -(}output{c )-}/PILA_results.dta", `replace'   ///
>                     coefmat(beta) varmat(vari) ci level(95)                         ///
>                     addlabel(outcome, `outcome', cohort, `cohort', year, `year',    ///
>                     month, `month', runvar, `runvar', model, "rdrobust")
>                     
>                     ** RDHonest estimation
>                     cap noi rdhonest `outcome' `runvar' if poblacion_`cohort' == 1 & ///
>                     fecha_pila == ym(`year',`month')
>                     
>                     cap noi mat beta = e(est)            // Store robust beta
>                     cap noi mat vari = e(se)^2           // Store robust SE
>                     local li95       = e(TCiL)
>                     local ui95       = e(TCiU)
>                     local M          = e(M)
>                     
>                     cap noi regsave using "${c -(}output{c )-}/PILA_results.dta", append      ///
>                     coefmat(beta) varmat(vari)                                      ///
>                     addlabel(outcome, `outcome', cohort, `cohort', year, `year',    ///
>                     month, `month', runvar, `runvar', model, "rdhonest",            ///
>                     ci_lower, `li95', ci_upper, `ui95', m_bound, `M')
>                     
>                     
>                     
>                     local replace append
>                     {c )-}
>                 {c )-}
>             {c )-}
>         {c )-}
>     {c )-}
>         
>     * Second cohorts (M54 & F59) retire in Dec. 2014, so 6 years pre and 6 post.
>     * This loop happens for all years in the loop (2009/2020)
>     /*foreach cohort in $second_cohorts{c -(}
>         
>         foreach outcome in $outcomes{c -(}
>             
>             forval month = 1/12{c -(}
>                 
>                 rdrobust `outcome' std_weeks if poblacion_`cohort' == 1 &       ///
>                 fecha_pila == ym(`year',`month'), vce(cluster std_weeks)
> 
>                 mat beta = e(tau_bc)                            // Store robust beta
>                 mat vari = e(se_tau_rb)^2                       // Store robust SE
> 
>             * Save estimation results in dataset
>             regsave using "${c -(}output{c )-}/PILA_results.dta", append coefmat(beta)    ///
>             varmat(vari) ci level(95) addlabel(outcome, `outcome', cohort,          ///
>             `cohort', year, `year', month, `month')
>             {c )-}
>         {c )-}
>     {c )-}*/
> {c )-}
> 
> 
> ****************************************************************************
> **#             3. Whole monthly panel regressions (with plots)
> ****************************************************************************
> preserve
> 
> keep if inrange(year, 2009, 2011)
> 
> 
> gen eligible_w = (std_weeks > 0)
> gen eligible_d = (std_days > 0)
> 
> 
> *** Whole monthly panel regressions
> 
> foreach cohort in $first_cohorts {c -(}
>     
>     foreach outcome in $outcomes {c -(}
>         
>         local varlab: variable label `outcome'
>         
>         if inlist("`outcome'", "pila_salario_r", "pila_salario_r_0") {c -(}
>             local dec = 0
>             local pren "10"
>         {c )-}
>         else {c -(}
>             local dec = 3
>             local pren "07"
>         {c )-}
>         
>         local elig eligible_w
>         local name "week"
>         foreach runvar in std_weeks std_days {c -(}
>             
>             dis as err "Cohort: `cohort'; Outcome: `outcome'; "             ///
>             "Runvar: `runvar' -> (2) Whole monthly panel RDD"
>             
>             qui rdrobust `outcome' `runvar' if poblacion_`cohort' == 1,     ///
>                 vce(hc3)
> 
>             local HL = e(h_l)
>             local HR = e(h_r)
> 
>             local B:    dis %`pren'.`dec'fc e(tau_bc)
>             local B:    dis strtrim("`B'")
> 
>             local t = e(tau_bc) / e(se_tau_rb)
> 
>             local N:    dis %10.0fc e(N_b_l) + e(N_b_r)
>             local N:    dis strtrim("`N'")
> 
>             if abs(`t') >= 1.645 {c -(}
>                 local B = "`B'*"
>             {c )-}
>             if abs(`t') >= 1.96 {c -(}
>                 local B = "`B'*"
>             {c )-}
>             if abs(`t') >= 2.576 {c -(}
>                 local B = "`B'*"
>             {c )-}
> 
> 
>             qui reg `outcome' i.`elig'##c.`runvar' if poblacion_`cohort' == 1 & ///
>                 inrange(`runvar', -`HL', `HR'), vce(hc3)
> 
>             local Breg: dis %`pren'.`dec'fc _b[1.`elig']
>             local Breg: dis strtrim("`Breg'")
> 
>             local t = _b[1.`elig'] / _se[1.`elig']
> 
>             if abs(`t') >= 1.645 {c -(}
>                 local Breg = "`Breg'*"
>             {c )-}
>             if abs(`t') >= 1.96 {c -(}
>                 local Breg = "`Breg'*"
>             {c )-}
>             if abs(`t') >= 2.576 {c -(}
>                 local Breg = "`Breg'*"
>             {c )-}
> 
>                         local HL:       dis %7.2f `HL'
>                         
>             rdplot `outcome' `runvar' if inrange(`runvar',-`HL',`HR'),          ///
>             vce(hc3) p(1) kernel(triangular) h(`HR' `HR')                           ///
>             binselect(esmv)     graph_options(title(`varlab', size(medium) span)    ///
>             subtitle(Cohort: `cohort'; `name' around cutoff: `HL', size(small)) ///
>             xtitle(Distance to `name' of birth's cutoff) ytitle("")             ///
>             legend(rows(1) position(bottom)) ylabel(, format(%`pren'.`dec'fc))  ///
>             note(`""Rdrobust {c -(}&beta{c )-}: `B'. Standard RDD {c -(}&beta{c )-}: `Breg'. Effective number of observations: `N'.""'))
> 
>                         
>             graph export "${c -(}graphs{c )-}\new\\`outcome'_`cohort'_`runvar'_rdplot.png",   ///
>                 replace width(1920) height(1080)
> 
> 
>             binscatterhist `outcome' `runvar' if poblacion_`cohort' == 1 &      ///
>             inrange(`runvar', -`HL', `HR'), vce(robust)                         ///
>             rd(0) linetype(lfit) title(`varlab', size(medium) span)             ///
>             subtitle(Cohort: `cohort'; `name' around cutoff: `HL', size(small)) ///
>             xtitle(Distance to `name' of birth's cutoff) ytitle("")             ///
>             ylabel(, format(%`pren'.`dec'fc))                                   ///
>             note(`""Rdrobust: `B'. Standard RDD: `Breg'. Effective number of observations: `N'.""')
> 
>             graph export "${c -(}graphs{c )-}\new\\`outcome'_`cohort'_`runvar'_bscatter.png", ///
>                 replace width(1920) height(1080)
> 
>             local elig eligible_d
>             local name day
>         {c )-}
>     {c )-}
> {c )-}
> 
> */
. 
. ****************************************************************************
. **#             4. Collapse at age level
. ****************************************************************************
. *restore
. 
. tempvar dia_pila
{txt}
{com}. gen `dia_pila' = dofm(fecha_pila + 1) - 1
{txt}
{com}. format %td `dia_pila'
{txt}
{com}. 
. gen age = age(fechantomode, `dia_pila')
{txt}
{com}. 
.                         
. 
. collapse (firstnm) poblacion* std_weeks std_days                    ///
>          (mean) pila_salario_r_0                                    ///
>          (max) pension codigo_pension pension_cum colpensiones      ///
>          pension_ibc pension_ibc_cum, by(personabasicaid age)
{res}{txt}
{com}. 
. sort personabasicaid age
{txt}
{com}. 
. gen eligible_w = (std_weeks > 0)
{txt}
{com}. gen eligible_d = (std_days > 0)
{txt}
{com}. 
. ****************************************************************************
. **#             5. Difference in discontinuities
. ****************************************************************************
. 
. local replace replace
{txt}
{com}. gen post = (age >= 60 & poblacion_M50 == 1) | (age >= 55 & poblacion_F55 == 1)
{txt}
{com}. 
. foreach cohort in $first_cohorts {c -(}
{txt}  2{com}.     
.     foreach outcome in $outcomes {c -(}
{txt}  3{com}.         
.         local elig eligible_w
{txt}  4{com}.         
.         foreach runvar in std_weeks std_days {c -(}
{txt}  5{com}.             
.         dis as err "Cohort: `cohort'; Outcome: `outcome'; "                 ///
>         "Runvar: `runvar' -> (3) Difference in discontinuities"
{txt}  6{com}.                 
.         clear results 
{txt}  7{com}.         
.         qui rdrobust `outcome' `runvar' if poblacion_`cohort' == 1 &        ///
>             post == 0, kernel(uniform)
{txt}  8{com}. 
.         scalar bw_pre = e(h_r)
{txt}  9{com}. 
.         qui rdrobust `outcome' `runvar' if poblacion_`cohort' == 1 &        ///
>             post == 1, kernel(uniform)
{txt} 10{com}. 
.         scalar bw_post = e(h_r)
{txt} 11{com}. 
.         scalar bw_avg = (bw_pre + bw_post) / 2
{txt} 12{com}. 
.         if mi(bw_avg) {c -(}
{txt} 13{com}.             scalar bw_avg = 21
{txt} 14{com}.         {c )-}
{txt} 15{com}.         
.         reg `outcome' i.`elig'##c.`runvar'##i.post if poblacion_`cohort' == 1 &  ///
>             abs(`runvar') <= bw_avg, robust
{txt} 16{com}.         
.         * Save estimation results in dataset
.         regsave 1.`elig'#1.post using "${c -(}output{c )-}/PILA_results_diffdisc.dta",    ///
>         `replace' ci level(95) addlabel(outcome, `outcome', cohort, `cohort',   ///
>         runvar, `runvar')
{txt} 17{com}.         
.         local replace append
{txt} 18{com}.         local elig eligible_d
{txt} 19{com}.         {c )-}
{txt} 20{com}.     {c )-}
{txt} 21{com}. {c )-}
{err}Cohort: M50; Outcome: codigo_pension; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   209,560
                                                {txt}F(7, 209552)      =  {res}  4134.50
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1193
                                                {txt}Root MSE          =    {res} .44702

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}             codigo_pension{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-.0059428{col 41}{space 2}  .010022{col 52}{space 1}   -0.59{col 61}{space 3}0.553{col 69}{space 4}-.0255856{col 82}{space 3}    .0137
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2} .0017725{col 41}{space 2} .0009333{col 52}{space 1}    1.90{col 61}{space 3}0.058{col 69}{space 4}-.0000567{col 82}{space 3} .0036018
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0006062{col 41}{space 2} .0013793{col 52}{space 1}   -0.44{col 61}{space 3}0.660{col 69}{space 4}-.0033095{col 82}{space 3} .0020971
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} -.459179{col 41}{space 2} .0071065{col 52}{space 1}  -64.61{col 61}{space 3}0.000{col 69}{space 4}-.4731076{col 82}{space 3}-.4452504
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} .0204601{col 41}{space 2} .0109206{col 52}{space 1}    1.87{col 61}{space 3}0.061{col 69}{space 4}-.0009439{col 82}{space 3} .0418641
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0002243{col 41}{space 2} .0010131{col 52}{space 1}   -0.22{col 61}{space 3}0.825{col 69}{space 4}  -.00221{col 82}{space 3} .0017613
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0018408{col 41}{space 2} .0015012{col 52}{space 1}   -1.23{col 61}{space 3}0.220{col 69}{space 4}-.0047832{col 82}{space 3} .0011016
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2}  .737618{col 41}{space 2} .0065324{col 52}{space 1}  112.92{col 61}{space 3}0.000{col 69}{space 4} .7248147{col 82}{space 3} .7504214
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: codigo_pension; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   202,345
                                                {txt}F(7, 202337)      =  {res}  3994.70
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1193
                                                {txt}Root MSE          =    {res} .44709

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}            codigo_pension{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-.0132357{col 40}{space 2} .0100978{col 51}{space 1}   -1.31{col 60}{space 3}0.190{col 68}{space 4}-.0330271{col 81}{space 3} .0065557
{txt}{space 18}std_days {c |}{col 28}{res}{space 2} .0003152{col 40}{space 2} .0001486{col 51}{space 1}    2.12{col 60}{space 3}0.034{col 68}{space 4}  .000024{col 81}{space 3} .0006064
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-.0000549{col 40}{space 2} .0002059{col 51}{space 1}   -0.27{col 60}{space 3}0.790{col 68}{space 4}-.0004584{col 81}{space 3} .0003487
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2}-.4630759{col 40}{space 2} .0078176{col 51}{space 1}  -59.23{col 60}{space 3}0.000{col 68}{space 4}-.4783983{col 81}{space 3}-.4477535
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} .0226074{col 40}{space 2} .0109972{col 51}{space 1}    2.06{col 60}{space 3}0.040{col 68}{space 4} .0010531{col 81}{space 3} .0441617
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-.0000998{col 40}{space 2} .0001613{col 51}{space 1}   -0.62{col 60}{space 3}0.536{col 68}{space 4} -.000416{col 81}{space 3} .0002164
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0001599{col 40}{space 2} .0002241{col 51}{space 1}   -0.71{col 60}{space 3}0.475{col 68}{space 4}-.0005991{col 81}{space 3} .0002793
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .7408622{col 40}{space 2} .0071849{col 51}{space 1}  103.11{col 60}{space 3}0.000{col 68}{space 4} .7267799{col 81}{space 3} .7549445
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pension; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   278,772
                                                {txt}F(7, 278764)      =  {res}     7.01
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .09181

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}                    pension{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-.0028754{col 41}{space 2} .0016014{col 52}{space 1}   -1.80{col 61}{space 3}0.073{col 69}{space 4}-.0060141{col 82}{space 3} .0002634
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2} .0002111{col 41}{space 2} .0001066{col 52}{space 1}    1.98{col 61}{space 3}0.048{col 69}{space 4} 2.28e-06{col 82}{space 3}   .00042
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0001557{col 41}{space 2} .0001719{col 52}{space 1}    0.91{col 61}{space 3}0.365{col 69}{space 4}-.0001812{col 82}{space 3} .0004926
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} .0015354{col 41}{space 2} .0011969{col 52}{space 1}    1.28{col 61}{space 3}0.200{col 69}{space 4}-.0008105{col 82}{space 3} .0038812
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} .0026396{col 41}{space 2} .0017854{col 52}{space 1}    1.48{col 61}{space 3}0.139{col 69}{space 4}-.0008597{col 82}{space 3}  .006139
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0001871{col 41}{space 2} .0001202{col 52}{space 1}   -1.56{col 61}{space 3}0.120{col 69}{space 4}-.0004228{col 82}{space 3} .0000486
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0001783{col 41}{space 2} .0001906{col 52}{space 1}   -0.94{col 61}{space 3}0.350{col 69}{space 4}-.0005518{col 82}{space 3} .0001953
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .0074907{col 41}{space 2} .0010747{col 52}{space 1}    6.97{col 61}{space 3}0.000{col 69}{space 4} .0053844{col 82}{space 3}  .009597
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str7}, now {bf:str14} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pension; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   240,526
                                                {txt}F(7, 240518)      =  {res}     5.85
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0001
                                                {txt}Root MSE          =    {res} .09168

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}                   pension{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-.0015516{col 40}{space 2} .0017037{col 51}{space 1}   -0.91{col 60}{space 3}0.362{col 68}{space 4}-.0048908{col 81}{space 3} .0017876
{txt}{space 18}std_days {c |}{col 28}{res}{space 2}  .000032{col 40}{space 2} .0000183{col 51}{space 1}    1.74{col 60}{space 3}0.082{col 68}{space 4}-4.00e-06{col 81}{space 3} .0000679
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} 1.39e-06{col 40}{space 2} .0000294{col 51}{space 1}    0.05{col 60}{space 3}0.962{col 68}{space 4}-.0000563{col 81}{space 3} .0000591
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2} .0018627{col 40}{space 2} .0013059{col 51}{space 1}    1.43{col 60}{space 3}0.154{col 68}{space 4}-.0006969{col 81}{space 3} .0044223
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} .0011501{col 40}{space 2} .0019052{col 51}{space 1}    0.60{col 60}{space 3}0.546{col 68}{space 4}-.0025841{col 81}{space 3} .0048843
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} -.000026{col 40}{space 2} .0000211{col 51}{space 1}   -1.23{col 60}{space 3}0.219{col 68}{space 4}-.0000673{col 81}{space 3} .0000154
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-5.27e-06{col 40}{space 2} .0000329{col 51}{space 1}   -0.16{col 60}{space 3}0.873{col 68}{space 4}-.0000698{col 81}{space 3} .0000592
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .0072652{col 40}{space 2} .0011566{col 51}{space 1}    6.28{col 60}{space 3}0.000{col 68}{space 4} .0049983{col 81}{space 3} .0095321
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str7}, now {bf:str14} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pension_cum; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   192,972
                                                {txt}F(7, 192964)      =  {res}  1455.24
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0135
                                                {txt}Root MSE          =    {res}   .272

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}                pension_cum{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-.0030478{col 41}{space 2}  .002017{col 52}{space 1}   -1.51{col 61}{space 3}0.131{col 69}{space 4}-.0070011{col 82}{space 3} .0009055
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2} .0002955{col 41}{space 2} .0001903{col 52}{space 1}    1.55{col 61}{space 3}0.120{col 69}{space 4}-.0000774{col 82}{space 3} .0006684
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0000835{col 41}{space 2} .0003038{col 52}{space 1}    0.27{col 61}{space 3}0.784{col 69}{space 4} -.000512{col 82}{space 3} .0006789
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} .0924047{col 41}{space 2} .0023573{col 52}{space 1}   39.20{col 61}{space 3}0.000{col 69}{space 4} .0877843{col 82}{space 3}  .097025
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0025836{col 41}{space 2} .0036266{col 52}{space 1}   -0.71{col 61}{space 3}0.476{col 69}{space 4}-.0096916{col 82}{space 3} .0045245
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0006905{col 41}{space 2} .0003539{col 52}{space 1}    1.95{col 61}{space 3}0.051{col 69}{space 4}-3.12e-06{col 82}{space 3} .0013842
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0011099{col 41}{space 2} .0005409{col 52}{space 1}   -2.05{col 61}{space 3}0.040{col 69}{space 4}-.0021702{col 82}{space 3}-.0000497
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .0084213{col 41}{space 2} .0013204{col 52}{space 1}    6.38{col 61}{space 3}0.000{col 69}{space 4} .0058333{col 82}{space 3} .0110093
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str14} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pension_cum; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   206,596
                                                {txt}F(7, 206588)      =  {res}  1554.93
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0135
                                                {txt}Root MSE          =    {res}  .2718

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}               pension_cum{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-.0011746{col 40}{space 2} .0019296{col 51}{space 1}   -0.61{col 60}{space 3}0.543{col 68}{space 4}-.0049565{col 81}{space 3} .0026073
{txt}{space 18}std_days {c |}{col 28}{res}{space 2}  .000031{col 40}{space 2} .0000245{col 51}{space 1}    1.26{col 60}{space 3}0.207{col 68}{space 4}-.0000171{col 81}{space 3} .0000791
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} 3.85e-06{col 40}{space 2} .0000387{col 51}{space 1}    0.10{col 60}{space 3}0.921{col 68}{space 4}-.0000719{col 81}{space 3} .0000796
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2} .0918853{col 40}{space 2} .0024152{col 51}{space 1}   38.04{col 60}{space 3}0.000{col 68}{space 4} .0871515{col 81}{space 3} .0966191
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0002651{col 40}{space 2} .0034681{col 51}{space 1}   -0.08{col 60}{space 3}0.939{col 68}{space 4}-.0070624{col 81}{space 3} .0065322
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} .0000955{col 40}{space 2} .0000472{col 51}{space 1}    2.02{col 60}{space 3}0.043{col 68}{space 4} 2.88e-06{col 81}{space 3} .0001881
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0001817{col 40}{space 2}  .000069{col 51}{space 1}   -2.63{col 60}{space 3}0.008{col 68}{space 4}-.0003171{col 81}{space 3}-.0000464
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .0077092{col 40}{space 2} .0013031{col 51}{space 1}    5.92{col 60}{space 3}0.000{col 68}{space 4} .0051551{col 81}{space 3} .0102632
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str14} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: colpensiones; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   192,972
                                                {txt}F(7, 192964)      =  {res}  3325.82
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1157
                                                {txt}Root MSE          =    {res} .43885

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}               colpensiones{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-.0135854{col 41}{space 2} .0109348{col 52}{space 1}   -1.24{col 61}{space 3}0.214{col 69}{space 4}-.0350174{col 82}{space 3} .0078466
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2} .0011472{col 41}{space 2} .0010951{col 52}{space 1}    1.05{col 61}{space 3}0.295{col 69}{space 4}-.0009992{col 82}{space 3} .0032937
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}   .00132{col 41}{space 2} .0016253{col 52}{space 1}    0.81{col 61}{space 3}0.417{col 69}{space 4}-.0018656{col 82}{space 3} .0045057
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2}-.4453408{col 41}{space 2} .0075971{col 52}{space 1}  -58.62{col 61}{space 3}0.000{col 69}{space 4}-.4602309{col 82}{space 3}-.4304506
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} .0283582{col 41}{space 2} .0117818{col 52}{space 1}    2.41{col 61}{space 3}0.016{col 69}{space 4} .0052661{col 82}{space 3} .0514503
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0000309{col 41}{space 2} .0011767{col 52}{space 1}    0.03{col 61}{space 3}0.979{col 69}{space 4}-.0022755{col 82}{space 3} .0023372
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0025044{col 41}{space 2} .0017507{col 52}{space 1}   -1.43{col 61}{space 3}0.153{col 69}{space 4}-.0059357{col 82}{space 3}  .000927
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .6943713{col 41}{space 2} .0070616{col 52}{space 1}   98.33{col 61}{space 3}0.000{col 69}{space 4} .6805307{col 82}{space 3} .7082118
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str12}, now {bf:str14} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: colpensiones; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   222,105
                                                {txt}F(7, 222097)      =  {res}  3817.02
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1160
                                                {txt}Root MSE          =    {res} .43805

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}              colpensiones{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-.0166412{col 40}{space 2} .0101006{col 51}{space 1}   -1.65{col 60}{space 3}0.099{col 68}{space 4}-.0364382{col 81}{space 3} .0031558
{txt}{space 18}std_days {c |}{col 28}{res}{space 2} .0003868{col 40}{space 2} .0001332{col 51}{space 1}    2.90{col 60}{space 3}0.004{col 68}{space 4} .0001258{col 81}{space 3} .0006478
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-.0001334{col 40}{space 2} .0001882{col 51}{space 1}   -0.71{col 60}{space 3}0.478{col 68}{space 4}-.0005022{col 81}{space 3} .0002354
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2}-.4536254{col 40}{space 2} .0076858{col 51}{space 1}  -59.02{col 60}{space 3}0.000{col 68}{space 4}-.4686894{col 81}{space 3}-.4385614
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} .0322206{col 40}{space 2} .0108745{col 51}{space 1}    2.96{col 60}{space 3}0.003{col 68}{space 4} .0109069{col 81}{space 3} .0535342
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-.0002354{col 40}{space 2} .0001429{col 51}{space 1}   -1.65{col 60}{space 3}0.099{col 68}{space 4}-.0005155{col 81}{space 3} .0000446
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0000537{col 40}{space 2} .0002024{col 51}{space 1}   -0.27{col 60}{space 3}0.791{col 68}{space 4}-.0004504{col 81}{space 3}  .000343
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2}  .701126{col 40}{space 2} .0071492{col 51}{space 1}   98.07{col 60}{space 3}0.000{col 68}{space 4} .6871138{col 81}{space 3} .7151383
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str12}, now {bf:str14} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pila_salario_r_0; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   246,194
                                                {txt}F(7, 246186)      =  {res}   267.88
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0086
                                                {txt}Root MSE          =    {res} 3.6e+06

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}           pila_salario_r_0{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-295745.2{col 41}{space 2} 133109.7{col 52}{space 1}   -2.22{col 61}{space 3}0.026{col 69}{space 4}-556636.7{col 82}{space 3}-34853.76
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2} 34859.05{col 41}{space 2} 12191.19{col 52}{space 1}    2.86{col 61}{space 3}0.004{col 69}{space 4} 10964.65{col 82}{space 3} 58753.45
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-31243.69{col 41}{space 2} 13752.96{col 52}{space 1}   -2.27{col 61}{space 3}0.023{col 69}{space 4}-58199.13{col 82}{space 3}-4288.242
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} -1083284{col 41}{space 2} 124301.1{col 52}{space 1}   -8.71{col 61}{space 3}0.000{col 69}{space 4} -1326911{col 82}{space 3}-839656.6
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} 244215.7{col 41}{space 2} 137340.7{col 52}{space 1}    1.78{col 61}{space 3}0.075{col 69}{space 4}-24968.48{col 82}{space 3}   513400
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-21919.85{col 41}{space 2} 12544.04{col 52}{space 1}   -1.75{col 61}{space 3}0.081{col 69}{space 4}-46505.83{col 82}{space 3} 2666.131
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} 17274.03{col 41}{space 2} 14217.86{col 52}{space 1}    1.21{col 61}{space 3}0.224{col 69}{space 4}-10592.59{col 82}{space 3} 45140.66
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2}  1977543{col 41}{space 2}   120933{col 52}{space 1}   16.35{col 61}{space 3}0.000{col 69}{space 4}  1740518{col 82}{space 3}  2214569
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pila_salario_r_0; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   255,203
                                                {txt}F(7, 255195)      =  {res}   260.48
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0081
                                                {txt}Root MSE          =    {res} 3.6e+06

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}          pila_salario_r_0{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-224247.3{col 40}{space 2} 147129.8{col 51}{space 1}   -1.52{col 60}{space 3}0.127{col 68}{space 4}-512617.8{col 81}{space 3} 64123.17
{txt}{space 18}std_days {c |}{col 28}{res}{space 2} 4008.653{col 40}{space 2} 1961.479{col 51}{space 1}    2.04{col 60}{space 3}0.041{col 68}{space 4} 164.2055{col 81}{space 3}   7853.1
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} -4209.88{col 40}{space 2} 2124.762{col 51}{space 1}   -1.98{col 60}{space 3}0.048{col 68}{space 4}-8374.356{col 81}{space 3}-45.40376
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2} -1101840{col 40}{space 2} 141639.6{col 51}{space 1}   -7.78{col 60}{space 3}0.000{col 68}{space 4} -1379450{col 81}{space 3}-824229.9
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} 227882.1{col 40}{space 2} 151626.3{col 51}{space 1}    1.50{col 60}{space 3}0.133{col 68}{space 4}-69301.38{col 81}{space 3} 525065.6
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-3386.459{col 40}{space 2} 2020.203{col 51}{space 1}   -1.68{col 60}{space 3}0.094{col 68}{space 4}-7346.002{col 81}{space 3} 573.0845
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} 3383.404{col 40}{space 2}  2196.31{col 51}{space 1}    1.54{col 60}{space 3}0.123{col 68}{space 4}-921.3061{col 81}{space 3} 7688.114
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2}  1948698{col 40}{space 2} 137867.7{col 51}{space 1}   14.13{col 60}{space 3}0.000{col 68}{space 4}  1678481{col 81}{space 3}  2218915
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pension_ibc; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   209,560
                                                {txt}F(7, 209552)      =  {res}    48.23
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0012
                                                {txt}Root MSE          =    {res} .24469

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}                pension_ibc{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-.0010264{col 41}{space 2} .0047184{col 52}{space 1}   -0.22{col 61}{space 3}0.828{col 69}{space 4}-.0102744{col 82}{space 3} .0082216
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2} .0003543{col 41}{space 2} .0004237{col 52}{space 1}    0.84{col 61}{space 3}0.403{col 69}{space 4}-.0004761{col 82}{space 3} .0011848
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0003277{col 41}{space 2} .0006534{col 52}{space 1}    0.50{col 61}{space 3}0.616{col 69}{space 4}-.0009529{col 82}{space 3} .0016082
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} .0235092{col 41}{space 2} .0034054{col 52}{space 1}    6.90{col 61}{space 3}0.000{col 69}{space 4} .0168347{col 82}{space 3} .0301836
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} .0007113{col 41}{space 2} .0053022{col 52}{space 1}    0.13{col 61}{space 3}0.893{col 69}{space 4}-.0096809{col 82}{space 3} .0111035
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} -.000593{col 41}{space 2} .0004798{col 52}{space 1}   -1.24{col 61}{space 3}0.217{col 69}{space 4}-.0015335{col 82}{space 3} .0003475
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0002228{col 41}{space 2} .0007332{col 52}{space 1}   -0.30{col 61}{space 3}0.761{col 69}{space 4}-.0016598{col 82}{space 3} .0012143
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .0439381{col 41}{space 2} .0030164{col 52}{space 1}   14.57{col 61}{space 3}0.000{col 69}{space 4}  .038026{col 82}{space 3} .0498502
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pension_ibc; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   204,308
                                                {txt}F(7, 204300)      =  {res}    47.39
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0012
                                                {txt}Root MSE          =    {res} .24479

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}               pension_ibc{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-.0031525{col 40}{space 2}  .004734{col 51}{space 1}   -0.67{col 60}{space 3}0.505{col 68}{space 4}-.0124309{col 81}{space 3}  .006126
{txt}{space 18}std_days {c |}{col 28}{res}{space 2} .0000696{col 40}{space 2} .0000674{col 51}{space 1}    1.03{col 60}{space 3}0.302{col 68}{space 4}-.0000625{col 81}{space 3} .0002017
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} .0000564{col 40}{space 2} .0000965{col 51}{space 1}    0.58{col 60}{space 3}0.559{col 68}{space 4}-.0001329{col 81}{space 3} .0002456
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2} .0226181{col 40}{space 2}  .003775{col 51}{space 1}    5.99{col 60}{space 3}0.000{col 68}{space 4} .0152191{col 81}{space 3} .0300171
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} .0028333{col 40}{space 2} .0053213{col 51}{space 1}    0.53{col 60}{space 3}0.594{col 68}{space 4}-.0075964{col 81}{space 3}  .013263
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-.0001046{col 40}{space 2} .0000761{col 51}{space 1}   -1.37{col 60}{space 3}0.170{col 68}{space 4}-.0002538{col 81}{space 3} .0000446
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0000402{col 40}{space 2} .0001083{col 51}{space 1}   -0.37{col 60}{space 3}0.711{col 68}{space 4}-.0002525{col 81}{space 3} .0001721
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .0448758{col 40}{space 2} .0033519{col 51}{space 1}   13.39{col 60}{space 3}0.000{col 68}{space 4} .0383062{col 81}{space 3} .0514454
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pension_ibc_cum; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   192,972
                                                {txt}F(7, 192964)      =  {res} 11831.95
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1428
                                                {txt}Root MSE          =    {res} .46292

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}            pension_ibc_cum{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-.0050859{col 41}{space 2} .0055929{col 52}{space 1}   -0.91{col 61}{space 3}0.363{col 69}{space 4}-.0160477{col 82}{space 3}  .005876
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2} .0010981{col 41}{space 2} .0005374{col 52}{space 1}    2.04{col 61}{space 3}0.041{col 69}{space 4} .0000448{col 82}{space 3} .0021513
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0001737{col 41}{space 2} .0008359{col 52}{space 1}    0.21{col 61}{space 3}0.835{col 69}{space 4}-.0014647{col 82}{space 3} .0018122
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} .5180863{col 41}{space 2} .0047982{col 52}{space 1}  107.98{col 61}{space 3}0.000{col 69}{space 4} .5086821{col 82}{space 3} .5274906
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} -.002559{col 41}{space 2}  .007484{col 52}{space 1}   -0.34{col 61}{space 3}0.732{col 69}{space 4}-.0172273{col 82}{space 3} .0121094
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0029846{col 41}{space 2} .0007302{col 52}{space 1}   -4.09{col 61}{space 3}0.000{col 69}{space 4}-.0044157{col 82}{space 3}-.0015535
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} .0023478{col 41}{space 2} .0011158{col 52}{space 1}    2.10{col 61}{space 3}0.035{col 69}{space 4} .0001608{col 82}{space 3} .0045347
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .0598396{col 41}{space 2} .0035689{col 52}{space 1}   16.77{col 61}{space 3}0.000{col 69}{space 4} .0528446{col 82}{space 3} .0668347
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str15}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: M50; Outcome: pension_ibc_cum; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   197,860
                                                {txt}F(7, 197852)      =  {res} 12176.93
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1431
                                                {txt}Root MSE          =    {res} .46286

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}           pension_ibc_cum{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-.0069309{col 40}{space 2} .0054491{col 51}{space 1}   -1.27{col 60}{space 3}0.203{col 68}{space 4} -.017611{col 81}{space 3} .0037492
{txt}{space 18}std_days {c |}{col 28}{res}{space 2} .0001842{col 40}{space 2} .0000793{col 51}{space 1}    2.32{col 60}{space 3}0.020{col 68}{space 4} .0000288{col 81}{space 3} .0003396
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-3.23e-06{col 40}{space 2} .0001137{col 51}{space 1}   -0.03{col 60}{space 3}0.977{col 68}{space 4}-.0002262{col 81}{space 3} .0002197
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2} .5272061{col 40}{space 2} .0051851{col 51}{space 1}  101.68{col 60}{space 3}0.000{col 68}{space 4} .5170434{col 81}{space 3} .5373687
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0163648{col 40}{space 2} .0072966{col 51}{space 1}   -2.24{col 60}{space 3}0.025{col 68}{space 4}-.0306661{col 81}{space 3}-.0020636
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-.0002413{col 40}{space 2} .0001073{col 51}{space 1}   -2.25{col 60}{space 3}0.024{col 68}{space 4}-.0004516{col 81}{space 3}-.0000311
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} .0002338{col 40}{space 2} .0001521{col 51}{space 1}    1.54{col 60}{space 3}0.124{col 68}{space 4}-.0000642{col 81}{space 3} .0005319
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .0612407{col 40}{space 2} .0038768{col 51}{space 1}   15.80{col 60}{space 3}0.000{col 68}{space 4} .0536422{col 81}{space 3} .0688391
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str15}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: codigo_pension; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   176,891
                                                {txt}F(7, 176883)      =  {res}  3673.81
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1085
                                                {txt}Root MSE          =    {res} .46299

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}             codigo_pension{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-.0014178{col 41}{space 2} .0102767{col 52}{space 1}   -0.14{col 61}{space 3}0.890{col 69}{space 4}-.0215599{col 82}{space 3} .0187243
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2}-.0003391{col 41}{space 2} .0011113{col 52}{space 1}   -0.31{col 61}{space 3}0.760{col 69}{space 4}-.0025172{col 82}{space 3}  .001839
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0000931{col 41}{space 2} .0016763{col 52}{space 1}   -0.06{col 61}{space 3}0.956{col 69}{space 4}-.0033786{col 82}{space 3} .0031923
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} -.461955{col 41}{space 2} .0072714{col 52}{space 1}  -63.53{col 61}{space 3}0.000{col 69}{space 4}-.4762069{col 82}{space 3}-.4477031
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} .0303365{col 41}{space 2} .0114076{col 52}{space 1}    2.66{col 61}{space 3}0.008{col 69}{space 4} .0079777{col 82}{space 3} .0526952
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0002367{col 41}{space 2}  .001233{col 52}{space 1}    0.19{col 61}{space 3}0.848{col 69}{space 4}  -.00218{col 82}{space 3} .0026534
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} .0002362{col 41}{space 2}   .00186{col 52}{space 1}    0.13{col 61}{space 3}0.899{col 69}{space 4}-.0034094{col 82}{space 3} .0038818
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .7807769{col 41}{space 2}  .006555{col 52}{space 1}  119.11{col 61}{space 3}0.000{col 69}{space 4} .7679293{col 82}{space 3} .7936245
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str14}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: codigo_pension; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   184,327
                                                {txt}F(7, 184319)      =  {res}  3863.76
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1092
                                                {txt}Root MSE          =    {res} .46276

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}            codigo_pension{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2} 7.70e-06{col 40}{space 2} .0099051{col 51}{space 1}    0.00{col 60}{space 3}0.999{col 68}{space 4}-.0194061{col 81}{space 3} .0194215
{txt}{space 18}std_days {c |}{col 28}{res}{space 2}-.0001464{col 40}{space 2} .0001585{col 51}{space 1}   -0.92{col 60}{space 3}0.356{col 68}{space 4}-.0004571{col 81}{space 3} .0001643
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} .0000931{col 40}{space 2} .0002217{col 51}{space 1}    0.42{col 60}{space 3}0.675{col 68}{space 4}-.0003415{col 81}{space 3} .0005276
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2}-.4581668{col 40}{space 2} .0078111{col 51}{space 1}  -58.66{col 60}{space 3}0.000{col 68}{space 4}-.4734763{col 81}{space 3}-.4428573
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} .0176139{col 40}{space 2} .0109974{col 51}{space 1}    1.60{col 60}{space 3}0.109{col 68}{space 4}-.0039407{col 81}{space 3} .0391684
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} .0002141{col 40}{space 2} .0001761{col 51}{space 1}    1.22{col 60}{space 3}0.224{col 68}{space 4}-.0001311{col 81}{space 3} .0005593
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} .0000486{col 40}{space 2} .0002462{col 51}{space 1}    0.20{col 60}{space 3}0.844{col 68}{space 4} -.000434{col 81}{space 3} .0005312
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .7790452{col 40}{space 2} .0070354{col 51}{space 1}  110.73{col 60}{space 3}0.000{col 68}{space 4}  .765256{col 81}{space 3} .7928345
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str14}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pension; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   211,666
                                                {txt}F(7, 211658)      =  {res}    15.79
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0003
                                                {txt}Root MSE          =    {res} .09523

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}                    pension{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2} .0004061{col 41}{space 2} .0017149{col 52}{space 1}    0.24{col 61}{space 3}0.813{col 69}{space 4} -.002955{col 82}{space 3} .0037672
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2} .0001313{col 41}{space 2} .0001431{col 52}{space 1}    0.92{col 61}{space 3}0.359{col 69}{space 4}-.0001493{col 82}{space 3} .0004118
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0000136{col 41}{space 2} .0002356{col 52}{space 1}   -0.06{col 61}{space 3}0.954{col 69}{space 4}-.0004754{col 82}{space 3} .0004481
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2}  .005441{col 41}{space 2} .0012261{col 52}{space 1}    4.44{col 61}{space 3}0.000{col 69}{space 4} .0030379{col 82}{space 3} .0078441
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0011841{col 41}{space 2} .0019568{col 52}{space 1}   -0.61{col 61}{space 3}0.545{col 69}{space 4}-.0050194{col 82}{space 3} .0026512
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0000551{col 41}{space 2} .0001667{col 52}{space 1}   -0.33{col 61}{space 3}0.741{col 69}{space 4}-.0003818{col 82}{space 3} .0002716
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0001351{col 41}{space 2} .0002676{col 52}{space 1}   -0.50{col 61}{space 3}0.614{col 69}{space 4}-.0006595{col 82}{space 3} .0003894
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .0052472{col 41}{space 2} .0010557{col 52}{space 1}    4.97{col 61}{space 3}0.000{col 69}{space 4}  .003178{col 82}{space 3} .0073164
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str7}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pension; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   230,438
                                                {txt}F(7, 230430)      =  {res}    16.40
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0003
                                                {txt}Root MSE          =    {res}  .0953

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}                   pension{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2} .0032087{col 40}{space 2} .0016021{col 51}{space 1}    2.00{col 60}{space 3}0.045{col 68}{space 4} .0000686{col 81}{space 3} .0063488
{txt}{space 18}std_days {c |}{col 28}{res}{space 2}-.0000239{col 40}{space 2} .0000192{col 51}{space 1}   -1.25{col 60}{space 3}0.213{col 68}{space 4}-.0000616{col 81}{space 3} .0000137
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} .0000266{col 40}{space 2}   .00003{col 51}{space 1}    0.89{col 60}{space 3}0.375{col 68}{space 4}-.0000322{col 81}{space 3} .0000855
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2}  .007698{col 40}{space 2}  .001189{col 51}{space 1}    6.47{col 60}{space 3}0.000{col 68}{space 4} .0053676{col 81}{space 3} .0100284
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} -.004413{col 40}{space 2} .0018413{col 51}{space 1}   -2.40{col 60}{space 3}0.017{col 68}{space 4} -.008022{col 81}{space 3}-.0008041
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} .0000412{col 40}{space 2} .0000224{col 51}{space 1}    1.84{col 60}{space 3}0.066{col 68}{space 4}-2.67e-06{col 81}{space 3} .0000851
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0000516{col 40}{space 2} .0000341{col 51}{space 1}   -1.52{col 60}{space 3}0.130{col 68}{space 4}-.0001184{col 81}{space 3} .0000151
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .0033336{col 40}{space 2} .0009907{col 51}{space 1}    3.36{col 60}{space 3}0.001{col 68}{space 4} .0013918{col 81}{space 3} .0052754
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str7}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pension_cum; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   230,932
                                                {txt}F(7, 230924)      =  {res}  2116.94
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0154
                                                {txt}Root MSE          =    {res} .28168

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}                pension_cum{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2} .0009106{col 41}{space 2} .0017119{col 52}{space 1}    0.53{col 61}{space 3}0.595{col 69}{space 4}-.0024447{col 82}{space 3} .0042658
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2}-.0000326{col 41}{space 2} .0001391{col 52}{space 1}   -0.23{col 61}{space 3}0.815{col 69}{space 4}-.0003052{col 82}{space 3}   .00024
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0002143{col 41}{space 2} .0002237{col 52}{space 1}    0.96{col 61}{space 3}0.338{col 69}{space 4}-.0002241{col 82}{space 3} .0006526
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} .1053411{col 41}{space 2} .0021462{col 52}{space 1}   49.08{col 61}{space 3}0.000{col 69}{space 4} .1011345{col 82}{space 3} .1095477
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0108776{col 41}{space 2}  .003275{col 52}{space 1}   -3.32{col 61}{space 3}0.001{col 69}{space 4}-.0172964{col 82}{space 3}-.0044587
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0005176{col 41}{space 2} .0002752{col 52}{space 1}    1.88{col 61}{space 3}0.060{col 69}{space 4}-.0000218{col 82}{space 3}  .001057
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0007977{col 41}{space 2} .0004153{col 52}{space 1}   -1.92{col 61}{space 3}0.055{col 69}{space 4}-.0016116{col 82}{space 3} .0000162
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .0049308{col 41}{space 2} .0010538{col 52}{space 1}    4.68{col 61}{space 3}0.000{col 69}{space 4} .0028654{col 82}{space 3} .0069962
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pension_cum; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   213,642
                                                {txt}F(7, 213634)      =  {res}  2013.05
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0156
                                                {txt}Root MSE          =    {res} .28187

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}               pension_cum{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2} .0027795{col 40}{space 2} .0017018{col 51}{space 1}    1.63{col 60}{space 3}0.102{col 68}{space 4} -.000556{col 81}{space 3}  .006115
{txt}{space 18}std_days {c |}{col 28}{res}{space 2}-8.82e-06{col 40}{space 2} .0000203{col 51}{space 1}   -0.43{col 60}{space 3}0.664{col 68}{space 4}-.0000486{col 81}{space 3}  .000031
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}  .000013{col 40}{space 2} .0000336{col 51}{space 1}    0.39{col 60}{space 3}0.699{col 68}{space 4}-.0000529{col 81}{space 3} .0000789
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2} .1064823{col 40}{space 2} .0023345{col 51}{space 1}   45.61{col 60}{space 3}0.000{col 68}{space 4} .1019066{col 81}{space 3} .1110579
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0099242{col 40}{space 2} .0033628{col 51}{space 1}   -2.95{col 60}{space 3}0.003{col 68}{space 4}-.0165153{col 81}{space 3}-.0033332
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} .0000749{col 40}{space 2} .0000452{col 51}{space 1}    1.66{col 60}{space 3}0.097{col 68}{space 4}-.0000136{col 81}{space 3} .0001635
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0001623{col 40}{space 2} .0000652{col 51}{space 1}   -2.49{col 60}{space 3}0.013{col 68}{space 4}  -.00029{col 81}{space 3}-.0000346
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .0041467{col 40}{space 2} .0010267{col 51}{space 1}    4.04{col 60}{space 3}0.000{col 68}{space 4} .0021344{col 81}{space 3} .0061589
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: colpensiones; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   193,245
                                                {txt}F(7, 193237)      =  {res}  3521.99
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1051
                                                {txt}Root MSE          =    {res}  .4586

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}               colpensiones{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-.0087512{col 41}{space 2} .0103306{col 52}{space 1}   -0.85{col 61}{space 3}0.397{col 69}{space 4} -.028999{col 82}{space 3} .0114966
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2}-.0009717{col 41}{space 2} .0010254{col 52}{space 1}   -0.95{col 61}{space 3}0.343{col 69}{space 4}-.0029814{col 82}{space 3}  .001038
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0020827{col 41}{space 2}  .001539{col 52}{space 1}    1.35{col 61}{space 3}0.176{col 69}{space 4}-.0009336{col 82}{space 3}  .005099
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2}-.4430352{col 41}{space 2} .0072952{col 52}{space 1}  -60.73{col 61}{space 3}0.000{col 69}{space 4}-.4573337{col 82}{space 3}-.4287368
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} .0342869{col 41}{space 2} .0113316{col 52}{space 1}    3.03{col 61}{space 3}0.002{col 69}{space 4} .0120773{col 82}{space 3} .0564965
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0018123{col 41}{space 2} .0011226{col 52}{space 1}    1.61{col 61}{space 3}0.106{col 69}{space 4} -.000388{col 82}{space 3} .0040125
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0026741{col 41}{space 2} .0016885{col 52}{space 1}   -1.58{col 61}{space 3}0.113{col 69}{space 4}-.0059836{col 82}{space 3} .0006354
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .7427128{col 41}{space 2} .0066632{col 52}{space 1}  111.47{col 61}{space 3}0.000{col 69}{space 4} .7296531{col 82}{space 3} .7557725
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str12}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: colpensiones; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   189,033
                                                {txt}F(7, 189025)      =  {res}  3431.15
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1048
                                                {txt}Root MSE          =    {res} .45858

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}              colpensiones{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-.0065145{col 40}{space 2} .0103295{col 51}{space 1}   -0.63{col 60}{space 3}0.528{col 68}{space 4}-.0267601{col 81}{space 3} .0137311
{txt}{space 18}std_days {c |}{col 28}{res}{space 2}-.0001173{col 40}{space 2}  .000162{col 51}{space 1}   -0.72{col 60}{space 3}0.469{col 68}{space 4}-.0004349{col 81}{space 3} .0002002
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} .0001477{col 40}{space 2} .0002256{col 51}{space 1}    0.65{col 60}{space 3}0.513{col 68}{space 4}-.0002946{col 81}{space 3} .0005899
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2} -.443471{col 40}{space 2} .0080544{col 51}{space 1}  -55.06{col 60}{space 3}0.000{col 68}{space 4}-.4592574{col 81}{space 3}-.4276845
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} .0230316{col 40}{space 2} .0113223{col 51}{space 1}    2.03{col 60}{space 3}0.042{col 68}{space 4} .0008402{col 81}{space 3} .0452229
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} .0002673{col 40}{space 2} .0001774{col 51}{space 1}    1.51{col 60}{space 3}0.132{col 68}{space 4}-.0000804{col 81}{space 3} .0006151
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0001078{col 40}{space 2} .0002473{col 51}{space 1}   -0.44{col 60}{space 3}0.663{col 68}{space 4}-.0005926{col 81}{space 3} .0003769
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .7442201{col 40}{space 2} .0073542{col 51}{space 1}  101.20{col 60}{space 3}0.000{col 68}{space 4} .7298061{col 81}{space 3}  .758634
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str12}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pila_salario_r_0; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   281,450
                                                {txt}F(7, 281442)      =  {res}   455.76
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0134
                                                {txt}Root MSE          =    {res} 2.5e+06

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}           pila_salario_r_0{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2}-159869.8{col 41}{space 2} 53439.48{col 52}{space 1}   -2.99{col 61}{space 3}0.003{col 69}{space 4}-264609.7{col 82}{space 3} -55129.9
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2}  5525.33{col 41}{space 2} 3911.221{col 52}{space 1}    1.41{col 61}{space 3}0.158{col 69}{space 4}-2140.555{col 82}{space 3} 13191.21
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} 3621.824{col 41}{space 2} 5628.654{col 52}{space 1}    0.64{col 61}{space 3}0.520{col 69}{space 4}-7410.183{col 82}{space 3} 14653.83
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2}-850089.2{col 41}{space 2} 40279.41{col 52}{space 1}  -21.10{col 61}{space 3}0.000{col 69}{space 4}-929035.7{col 82}{space 3}-771142.7
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}   119724{col 41}{space 2} 57156.62{col 52}{space 1}    2.09{col 61}{space 3}0.036{col 69}{space 4} 7698.564{col 82}{space 3} 231749.4
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-2319.329{col 41}{space 2} 4166.103{col 52}{space 1}   -0.56{col 61}{space 3}0.578{col 69}{space 4}-10484.78{col 82}{space 3} 5846.119
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} 163.3194{col 41}{space 2}  6002.81{col 52}{space 1}    0.03{col 61}{space 3}0.978{col 69}{space 4}-11602.02{col 82}{space 3} 11928.66
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2}  1751572{col 41}{space 2} 37689.55{col 52}{space 1}   46.47{col 61}{space 3}0.000{col 69}{space 4}  1677702{col 82}{space 3}  1825443
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pila_salario_r_0; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   313,677
                                                {txt}F(7, 313669)      =  {res}   521.72
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0139
                                                {txt}Root MSE          =    {res} 2.4e+06

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}          pila_salario_r_0{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-69638.37{col 40}{space 2} 50886.47{col 51}{space 1}   -1.37{col 60}{space 3}0.171{col 68}{space 4}-169374.4{col 81}{space 3} 30097.66
{txt}{space 18}std_days {c |}{col 28}{res}{space 2} 463.3675{col 40}{space 2}  490.118{col 51}{space 1}    0.95{col 60}{space 3}0.344{col 68}{space 4}-497.2499{col 81}{space 3} 1423.985
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-217.8661{col 40}{space 2} 680.9486{col 51}{space 1}   -0.32{col 60}{space 3}0.749{col 68}{space 4}-1552.506{col 81}{space 3} 1116.774
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2}-814190.6{col 40}{space 2} 39348.71{col 51}{space 1}  -20.69{col 60}{space 3}0.000{col 68}{space 4}-891312.9{col 81}{space 3}-737068.2
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} 52192.61{col 40}{space 2} 54415.14{col 51}{space 1}    0.96{col 60}{space 3}0.337{col 68}{space 4}-54459.51{col 81}{space 3} 158844.7
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} 305.7399{col 40}{space 2} 522.2928{col 51}{space 1}    0.59{col 60}{space 3}0.558{col 68}{space 4}-717.9391{col 81}{space 3} 1329.419
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-319.1422{col 40}{space 2} 724.5823{col 51}{space 1}   -0.44{col 60}{space 3}0.660{col 68}{space 4}-1739.303{col 81}{space 3} 1101.019
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2}  1727443{col 40}{space 2} 36676.12{col 51}{space 1}   47.10{col 60}{space 3}0.000{col 68}{space 4}  1655559{col 81}{space 3}  1799327
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pension_ibc; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   159,549
                                                {txt}F(7, 159541)      =  {res}    71.07
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0020
                                                {txt}Root MSE          =    {res} .23249

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}                pension_ibc{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2} .0018588{col 41}{space 2} .0047341{col 52}{space 1}    0.39{col 61}{space 3}0.695{col 69}{space 4}  -.00742{col 82}{space 3} .0111375
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2}  .000862{col 41}{space 2}  .000525{col 52}{space 1}    1.64{col 61}{space 3}0.101{col 69}{space 4}-.0001671{col 82}{space 3}  .001891
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0005358{col 41}{space 2} .0008412{col 52}{space 1}   -0.64{col 61}{space 3}0.524{col 69}{space 4}-.0021846{col 82}{space 3} .0011129
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} .0287943{col 41}{space 2} .0033639{col 52}{space 1}    8.56{col 61}{space 3}0.000{col 69}{space 4} .0222011{col 82}{space 3} .0353875
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0033118{col 41}{space 2} .0054254{col 52}{space 1}   -0.61{col 61}{space 3}0.542{col 69}{space 4}-.0139454{col 82}{space 3} .0073219
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0010537{col 41}{space 2} .0006146{col 52}{space 1}   -1.71{col 61}{space 3}0.086{col 69}{space 4}-.0022583{col 82}{space 3} .0001509
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2} .0005229{col 41}{space 2} .0009667{col 52}{space 1}    0.54{col 61}{space 3}0.589{col 69}{space 4}-.0013719{col 82}{space 3} .0024177
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .0338019{col 41}{space 2} .0029031{col 52}{space 1}   11.64{col 61}{space 3}0.000{col 69}{space 4} .0281119{col 82}{space 3} .0394919
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pension_ibc; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   176,618
                                                {txt}F(7, 176610)      =  {res}    80.57
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0021
                                                {txt}Root MSE          =    {res} .23259

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}               pension_ibc{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-.0001909{col 40}{space 2} .0043793{col 51}{space 1}   -0.04{col 60}{space 3}0.965{col 68}{space 4}-.0087742{col 81}{space 3} .0083925
{txt}{space 18}std_days {c |}{col 28}{res}{space 2} .0001103{col 40}{space 2} .0000713{col 51}{space 1}    1.55{col 60}{space 3}0.122{col 68}{space 4}-.0000295{col 81}{space 3} .0002501
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-.0000213{col 40}{space 2} .0001019{col 51}{space 1}   -0.21{col 60}{space 3}0.835{col 68}{space 4} -.000221{col 81}{space 3} .0001784
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2} .0295238{col 40}{space 2}  .003591{col 51}{space 1}    8.22{col 60}{space 3}0.000{col 68}{space 4} .0224855{col 81}{space 3}  .036562
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0018433{col 40}{space 2} .0050445{col 51}{space 1}   -0.37{col 60}{space 3}0.715{col 68}{space 4}-.0117305{col 81}{space 3} .0080439
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-.0001268{col 40}{space 2} .0000832{col 51}{space 1}   -1.52{col 60}{space 3}0.127{col 68}{space 4}-.0002898{col 81}{space 3} .0000362
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} .0000109{col 40}{space 2} .0001175{col 51}{space 1}    0.09{col 60}{space 3}0.926{col 68}{space 4}-.0002194{col 81}{space 3} .0002411
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2}  .033674{col 40}{space 2} .0031013{col 51}{space 1}   10.86{col 60}{space 3}0.000{col 68}{space 4} .0275955{col 81}{space 3} .0397526
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str11}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pension_ibc_cum; Runvar: std_weeks -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   193,245
                                                {txt}F(7, 193237)      =  {res} 12750.96
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1354
                                                {txt}Root MSE          =    {res} .46428

{txt}{hline 28}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 29}{c |}{col 41}    Robust
{col 1}            pension_ibc_cum{col 29}{c |} Coefficient{col 41}  std. err.{col 53}      t{col 61}   P>|t|{col 69}     [95% con{col 82}f. interval]
{hline 28}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 15}1.eligible_w {c |}{col 29}{res}{space 2} .0007993{col 41}{space 2} .0049121{col 52}{space 1}    0.16{col 61}{space 3}0.871{col 69}{space 4}-.0088282{col 82}{space 3} .0104268
{txt}{space 18}std_weeks {c |}{col 29}{res}{space 2} .0008157{col 41}{space 2} .0004581{col 52}{space 1}    1.78{col 61}{space 3}0.075{col 69}{space 4}-.0000821{col 82}{space 3} .0017135
{txt}{space 27} {c |}
{space 5}eligible_w#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2} .0002811{col 41}{space 2} .0007378{col 52}{space 1}    0.38{col 61}{space 3}0.703{col 69}{space 4} -.001165{col 82}{space 3} .0017273
{txt}{space 27} {c |}
{space 21}1.post {c |}{col 29}{res}{space 2} .5177323{col 41}{space 2} .0044365{col 52}{space 1}  116.70{col 61}{space 3}0.000{col 69}{space 4} .5090369{col 82}{space 3} .5264277
{txt}{space 27} {c |}
{space 12}eligible_w#post {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0106614{col 41}{space 2}  .007004{col 52}{space 1}   -1.52{col 61}{space 3}0.128{col 69}{space 4} -.024389{col 82}{space 3} .0030662
{txt}{space 27} {c |}
{space 11}post#c.std_weeks {c |}
{space 25}1  {c |}{col 29}{res}{space 2}-.0020481{col 41}{space 2} .0006759{col 52}{space 1}   -3.03{col 61}{space 3}0.002{col 69}{space 4}-.0033728{col 82}{space 3}-.0007234
{txt}{space 27} {c |}
eligible_w#post#c.std_weeks {c |}
{space 23}1 1  {c |}{col 29}{res}{space 2}-.0015182{col 41}{space 2} .0010494{col 52}{space 1}   -1.45{col 61}{space 3}0.148{col 69}{space 4} -.003575{col 82}{space 3} .0005385
{txt}{space 27} {c |}
{space 22}_cons {c |}{col 29}{res}{space 2} .0427886{col 41}{space 2}  .003048{col 52}{space 1}   14.04{col 61}{space 3}0.000{col 69}{space 4} .0368147{col 82}{space 3} .0487625
{txt}{hline 28}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str15}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}
{err}Cohort: F55; Outcome: pension_ibc_cum; Runvar: std_days -> (3) Difference in discontinuities

{txt}Linear regression                               Number of obs     = {res}   171,444
                                                {txt}F(7, 171436)      =  {res} 11512.39
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1361
                                                {txt}Root MSE          =    {res} .46408

{txt}{hline 27}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 28}{c |}{col 40}    Robust
{col 1}           pension_ibc_cum{col 28}{c |} Coefficient{col 40}  std. err.{col 52}      t{col 60}   P>|t|{col 68}     [95% con{col 81}f. interval]
{hline 27}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 14}1.eligible_d {c |}{col 28}{res}{space 2}-.0017156{col 40}{space 2} .0050111{col 51}{space 1}   -0.34{col 60}{space 3}0.732{col 68}{space 4}-.0115371{col 81}{space 3}  .008106
{txt}{space 18}std_days {c |}{col 28}{res}{space 2} .0002057{col 40}{space 2} .0000829{col 51}{space 1}    2.48{col 60}{space 3}0.013{col 68}{space 4} .0000432{col 81}{space 3} .0003683
{txt}{space 26} {c |}
{space 5}eligible_d#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2}-.0001024{col 40}{space 2} .0001188{col 51}{space 1}   -0.86{col 60}{space 3}0.389{col 68}{space 4}-.0003353{col 81}{space 3} .0001305
{txt}{space 26} {c |}
{space 20}1.post {c |}{col 28}{res}{space 2} .5303802{col 40}{space 2} .0051524{col 51}{space 1}  102.94{col 60}{space 3}0.000{col 68}{space 4} .5202816{col 81}{space 3} .5404787
{txt}{space 26} {c |}
{space 11}eligible_d#post {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2}-.0295038{col 40}{space 2} .0072437{col 51}{space 1}   -4.07{col 60}{space 3}0.000{col 68}{space 4}-.0437012{col 81}{space 3}-.0153063
{txt}{space 26} {c |}
{space 11}post#c.std_days {c |}
{space 24}1  {c |}{col 28}{res}{space 2} 1.63e-06{col 40}{space 2} .0001228{col 51}{space 1}    0.01{col 60}{space 3}0.989{col 68}{space 4} -.000239{col 81}{space 3} .0002422
{txt}{space 26} {c |}
eligible_d#post#c.std_days {c |}
{space 22}1 1  {c |}{col 28}{res}{space 2} -.000335{col 40}{space 2} .0001731{col 51}{space 1}   -1.94{col 60}{space 3}0.053{col 68}{space 4}-.0006743{col 81}{space 3} 4.18e-06
{txt}{space 26} {c |}
{space 21}_cons {c |}{col 28}{res}{space 2} .0453245{col 40}{space 2} .0035593{col 51}{space 1}   12.73{col 60}{space 3}0.000{col 68}{space 4} .0383484{col 81}{space 3} .0523006
{txt}{hline 27}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}{p 0 7 2}
(variable
{bf:outcome} was {bf:str15}, now {bf:str16} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:runvar} was {bf:str8}, now {bf:str9} to accommodate using data's values)
{p_end}
{p 0 4 2}
file {bf}
\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Output/PILA_results_diffdisc.dta{rm}
saved
{p_end}

{com}. 
. /*      
> ****************************************************************************
> **#             6. RDD by age
> ****************************************************************************
> 
> foreach cohort in $first_cohorts {c -(}
>     
>     qui sum age if poblacion_`cohort' == 1
>     local min = r(min) + 1
>     local max = r(max) - 1
>     
>     foreach outcome in $outcomes {c -(}
>         
>         foreach runvar in std_weeks std_days {c -(}
>             
>             forval age = `min'/`max'{c -(}
>                 
>                 dis as err "Cohort: `cohort'; Outcome: `outcome'; Age: "    ///
>                 "`age'; Runvar: `runvar' -> (4) Age by age RDD"
>                 
>                                 clear results
>                                 
>                 cap noi rdrobust `outcome' `runvar' if poblacion_`cohort' == 1  ///
>                 & age == `age', vce(hc3) masspoints(check)
> 
>                 mat beta = e(tau_bc)            // Store robust beta
>                 mat vari = e(se_tau_rb)^2       // Store robust SE
> 
>                 * Save estimation results in dataset
>                 cap noi regsave using "${c -(}output{c )-}/PILA_results.dta", append      ///
>                 coefmat(beta) varmat(vari) ci level(95)                         ///
>                 addlabel(outcome, `outcome', cohort, `cohort', age, `age',      ///
>                 runvar, `runvar', model, "rdrobust")
>                 
>                                 clear results
>                 
>                 ** RDHonest estimation
>                 cap noi rdhonest `outcome' `runvar' if poblacion_`cohort' == 1 & ///
>                 age == `age'
>                 
>                 cap noi mat beta = e(est)            // Store robust beta
>                 cap noi mat vari = e(se)^2           // Store robust SE
>                 local li95       = e(TCiL)
>                 local ui95       = e(TCiU)
>                 local M          = e(M)
>                 
>                 cap noi regsave using "${c -(}output{c )-}/PILA_results.dta", append      ///
>                 coefmat(beta) varmat(vari)                                      ///
>                 addlabel(outcome, `outcome', cohort, `cohort', age, `age',      ///
>                 runvar, `runvar', model, "rdhonest",                            ///
>                 ci_lower, `li95', ci_upper, `ui95', m_bound, `M')
>                 
>             {c )-}
>         {c )-}
>     {c )-}
> {c )-}
>         
>         
> ****************************************************************************
> **#             7. Whole age panel regressions (with plots)
> ****************************************************************************
> 
> foreach cohort in $first_cohorts {c -(}
>     
>     if "`cohort'" == "M50"      local ages "59, 62"
>     else                        local ages "54, 57"
>     
>     foreach outcome in $outcomes {c -(}
>         
>         local varlab: variable label `outcome'
>         
>         if inlist("`outcome'", "pila_salario_r", "pila_salario_r_0") {c -(}
>             local dec = 0
>             local pren "10"
>         {c )-}
>         else {c -(}
>             local dec = 3
>             local pren "07"
>         {c )-}
>         
>         local elig eligible_w
>         local name "week"
>         foreach runvar in std_weeks std_days {c -(}
>         
>             dis as err "Cohort: `cohort'; Outcome: `outcome'; "             ///
>             "Runvar: `runvar' -> (5) Whole age panel RDD"
>         
>             qui rdrobust `outcome' `runvar' if poblacion_`cohort' == 1 &    ///
>                 inrange(age, `ages'), vce(hc3)
> 
>             local HL = e(h_l)
>             local HR = e(h_r)
> 
>             local B:    dis %`pren'.`dec'fc e(tau_bc)
>             local B:    dis strtrim("`B'")
> 
>             local t = e(tau_bc) / e(se_tau_rb)
> 
>             local N:    dis %10.0fc e(N_b_l) + e(N_b_r)
>             local N:    dis strtrim("`N'")
> 
>             if abs(`t') >= 1.645 {c -(}
>                 local B = "`B'*"
>             {c )-}
>             if abs(`t') >= 1.96 {c -(}
>                 local B = "`B'*"
>             {c )-}
>             if abs(`t') >= 2.576 {c -(}
>                 local B = "`B'*"
>             {c )-}
> 
> 
>             qui reg `outcome' i.`elig'##c.`runvar' if poblacion_`cohort' == 1 & ///
>                 inrange(`runvar', -`HL', `HR') & inrange(age, `ages'),          ///
>                 vce(hc3)
> 
>             local Breg: dis %`pren'.`dec'fc _b[1.`elig']
>             local Breg: dis strtrim("`Breg'")
> 
>             local t = _b[1.`elig'] / _se[1.`elig']
> 
>             if abs(`t') >= 1.645 {c -(}
>                 local Breg = "`Breg'*"
>             {c )-}
>             if abs(`t') >= 1.96 {c -(}
>                 local Breg = "`Breg'*"
>             {c )-}
>             if abs(`t') >= 2.576 {c -(}
>                 local Breg = "`Breg'*"
>             {c )-}
> 
>             local HL:   dis %7.2f `HL'
> 
>             rdplot `outcome' `runvar' if inrange(`runvar',-`HL',`HR') &         ///
>             inrange(age, `ages'), vce(hc3) p(1) kernel(triangular)              ///
>             h(`HR' `HR') binselect(esmv)                                        ///
>             graph_options(title(`varlab', size(medium) span)                    ///
>             subtitle(Cohort: `cohort'; `name' around cutoff: `HL', size(small)) ///
>             xtitle(Distance to `name' of birth's cutoff) ytitle("")             ///
>             legend(rows(1) position(bottom)) ylabel(, format(%`pren'.`dec'fc))  ///
>             note(`""Rdrobust {c -(}&beta{c )-}: `B'. Standard RDD {c -(}&beta{c )-}: `Breg'. Effective number of observations: `N'.""'))
> 
>             scalar b_l = e(J_star_l)
>             scalar b_r = e(J_star_r)
>             scalar b_avg = (b_l + b_r) / 2
> 
>             graph export "${c -(}graphs{c )-}\new\\`outcome'_`cohort'_`runvar'_rdplot_ages.png",  ///
>                 replace width(1920) height(1080)
> 
> 
>             binscatterhist `outcome' `runvar' if poblacion_`cohort' == 1 &      ///
>             inrange(`runvar', -`HL', `HR') & inrange(age, `ages'),              ///
>             vce(robust) rd(0) linetype(lfit)                                    ///
>             title(`varlab', size(medium) span)                                  ///
>             subtitle(Cohort: `cohort'; `name' around cutoff: `HL', size(small)) ///
>             xtitle(Distance to `name' of birth's cutoff) ytitle("")             ///
>             ylabel(, format(%`pren'.`dec'fc))                                      ///
>             note(`""Rdrobust: `B'. Standard RDD: `Breg'. Effective number of observations: `N'.""')
> 
>             graph export "${c -(}graphs{c )-}\new\\`outcome'_`cohort'_`runvar'_bscatter_ages.png", ///
>                 replace width(1920) height(1080)
> 
>             local elig eligible_d
>             local name day
>         {c )-}
>     {c )-}
> {c )-}
> */
.         
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}\\wmedesrv/GAMMA/Christian Posso/_banrep_research/proyectos/pensions/Logs\PILA estimations.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Jul 2025, 18:18:34
{txt}{.-}
{smcl}
{txt}{sf}{ul off}