{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}Z:/Christian Posso/_banrep_research/proyectos/pensions/Logs/Summary stats.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Sep 2025, 15:57:44
{txt}
{com}. 
. ****************************************************************************
. **#         1. Get main N
. ****************************************************************************
. 
. use "${c -(}data{c )-}/Master_sample.dta", clear
{txt}
{com}. 
. keep if poblacion_M50 == 1 | poblacion_F55 == 1
{txt}(777,825 observations deleted)

{com}. 
. count
  {res}653,957
{txt}
{com}. 
. local total_n = strtrim("`: di %10.0fc r(N)'")
{txt}
{com}. 
. texresults3 using "${c -(}tables{c )-}/numbers.txt", texmacro(totalN)             ///
> result(`total_n') append
{txt}
{com}. 
. ****************************************************************************
. **#         2. Plot histograms
. ****************************************************************************
. 
. use "${c -(}data{c )-}/Master_for_RIPS.dta", clear
{txt}
{com}. 
. count if poblacion_M50 == 1 | poblacion_F55 == 1
  {res}326,050
{txt}
{com}. 
. local master_n = strtrim("`: di %10.0fc r(N)'")
{txt}
{com}. 
. texresults3 using "${c -(}tables{c )-}/numbers.txt", texmacro(masterN)            ///
> result(`master_n') append
{txt}
{com}. 
. count if poblacion_F55 == 1
  {res}160,738
{txt}
{com}. local f55_n = strtrim("`: di %10.0fc r(N)'")
{txt}
{com}. 
. count if poblacion_M50 == 1
  {res}165,312
{txt}
{com}. local m50_n = strtrim("`: di %10.0fc r(N)'")
{txt}
{com}. 
. * Histograms using roughly a bin per week (5 years * 52 weeks = 260)
. 
. * M50
. qui rddensity std_weeks if poblacion_M50 == 1
{txt}
{com}. local pvalue = e(pv_q)
{txt}
{com}. 
. texresults3 using "${c -(}tables{c )-}/numbers.txt", texmacro(pvalMw)            ///
> result(`pvalue') append round(3)
{txt}
{com}. 
. qui rddensity std_days if poblacion_M50 == 1
{txt}
{com}. local pvalue_d = e(pv_q)
{txt}
{com}. 
. texresults3 using "${c -(}tables{c )-}/numbers.txt", texmacro(pvalMd)            ///
> result(`pvalue_d') append round(3)
{txt}
{com}. 
. twoway (hist fechantomode if poblacion_M50 == 1, xla(#15, angle(90)     ///
> format("%td")) xtitle(Date of birth)      ///
> bin(260) freq ylabel(, format(%10.0fc))),           ///
> xline(-3441, noextend lcolor(red) lpattern(solid)) legend(off)
{res}{txt}
{com}. 
. graph export "${c -(}graphs{c )-}/hist_M50.png", replace
{txt}{p 0 4 2}
file {bf}
Z:/Christian Posso/_banrep_research/proyectos/pensions/Graphs/hist_M50.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. /* M54
> qui rddensity std_weeks if poblacion_M54 == 1
> local pvalue: dis %04.3f e(pv_q)
> 
> qui rddensity std_days if poblacion_M54 == 1
> local pvalue_d: dis %04.3f e(pv_q)
> 
> twoway (hist fechantomode if poblacion_M54 == 1, xla(#15, angle(90)     ///
> format("%td")) xtitle(Date of birth) title(Men born between 52-56)      ///
> note("Manipulation test p-value weeks: `pvalue'"                        ///
> "Manipulation test p-value days: `pvalue_d'") bin(260) freq),           ///
> xline(-1827, noextend lcolor(red) lpattern(solid)) legend(off)
> 
> graph export "${c -(}graphs{c )-}/hist_M54.png", replace
> */
. 
. * F55
. qui rddensity std_weeks if poblacion_F55 == 1
{txt}
{com}. local pvalue = e(pv_q)
{txt}
{com}. 
. texresults3 using "${c -(}tables{c )-}/numbers.txt", texmacro(pvalFw)            ///
> result(`pvalue') append round(3)
{txt}
{com}. 
. qui rddensity std_days if poblacion_F55 == 1
{txt}
{com}. local pvalue_d = e(pv_q)
{txt}
{com}. 
. texresults3 using "${c -(}tables{c )-}/numbers.txt", texmacro(pvalFd)            ///
> result(`pvalue_d') append round(3)
{txt}
{com}. 
. twoway (hist fechantomode if poblacion_F55 == 1, xla(#15, angle(90)     ///
> format("%td")) xtitle(Date of birth)   ///
> bin(260) freq ylabel(, format(%10.0fc))),           ///
> xline(-1615, noextend lcolor(red) lpattern(solid)) legend(off)
{res}{txt}
{com}. 
. graph export "${c -(}graphs{c )-}/hist_F55.png", replace
{txt}{p 0 4 2}
file {bf}
Z:/Christian Posso/_banrep_research/proyectos/pensions/Graphs/hist_F55.png{rm}
saved as
PNG
format
{p_end}

{com}. 
. 
. /* F59
> qui rddensity std_weeks if poblacion_F59 == 1
> local pvalue: dis %04.3f e(pv_q)
> 
> qui rddensity std_days if poblacion_F59 == 1
> local pvalue_d: dis %04.3f e(pv_q)
> 
> twoway (hist fechantomode if poblacion_F59 == 1, xla(#15, angle(90)     ///
> format("%td")) xtitle(Date of birth) title(Women born between 57-61)    ///
> note("Manipulation test p-value weeks: `pvalue'"                        ///
> "Manipulation test p-value days: `pvalue_d'") bin(260) freq),           ///
> xline(-1, noextend lcolor(red) lpattern(solid)) legend(off)
> 
> graph export "${c -(}graphs{c )-}/hist_F59.png", replace
> 
> */
. 
. 
. ****************************************************************************
. **#         3. Summary stats table
. ****************************************************************************
. 
. 
. ** PILA
. use if (poblacion_M50 == 1 | poblacion_F55 == 1) using "${c -(}data{c )-}/Estimation_sample_PILA.dta", clear
{txt}
{com}. 
. replace pila_salario_r_0 = . if pila_salario_r_0 == 0
{txt}(27,094,533 real changes made, 27,094,533 to missing)

{com}. 
. collapse (mean) pila_salario_r_0 ibc_pens (max) pension_ibc   ///
>          (firstnm) poblacion*, by(personabasicaid)
{res}{txt}
{com}. 
. rename (pila_salario_r_0 ibc_pens pension_ibc) (wage ibc pension)
{res}{txt}
{com}. 
. local coh "M"
{txt}
{com}. foreach cohort in M50 F55 {c -(}
{txt}  2{com}.     
.     foreach outcome in wage ibc pension {c -(}
{txt}  3{com}.         
.         if "`outcome'" == "pension" {c -(}
{txt}  4{com}.             local fmt "3"
{txt}  5{com}.             local add "*100"
{txt}  6{com}.             local rounded "round(1)"
{txt}  7{com}.         {c )-}
{txt}  8{com}.         else{c -(}
{txt}  9{com}.             local fmt "0"
{txt} 10{com}.             local add ""
{txt} 11{com}.             local rounded ""
{txt} 12{com}.         {c )-}
{txt} 13{com}.         
.         sum `outcome' if poblacion_`cohort' == 1
{txt} 14{com}.         local m_`outcome'_`cohort'   : di %13.`fmt'fc r(mean)
{txt} 15{com}.         local sd_`outcome'_`cohort'  : di %13.`fmt'fc r(sd)
{txt} 16{com}.         local min_`outcome'_`cohort' : di %13.0fc r(min)
{txt} 17{com}.         local max_`outcome'_`cohort' : di %13.0fc r(max)
{txt} 18{com}.         
.         local `outcome'_`cohort': di %10.`fmt'fc r(mean)`add'
{txt} 19{com}. 
.         texresults3 using "${c -(}tables{c )-}/numbers.txt", texmacro(`outcome'`coh')  ///
>         result(``outcome'_`cohort'') append `rounded'
{txt} 20{com}.     {c )-}
{txt} 21{com}.     
.     _pctile wage if poblacion_`cohort' == 1, p(99)
{txt} 22{com}.     local max_wage_`cohort' : di %13.0fc r(r1)
{txt} 23{com}.     local coh "F"
{txt} 24{com}. {c )-}

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}wage {c |}{res}    165,298     2091875     3721946    1476.51   3.67e+08

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}ibc {c |}{res}    165,304     1100660     1646118          0   4.35e+07

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}pension {c |}{res}    165,312    .8132985    .3896729          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}wage {c |}{res}    160,733     2042344     2721733    23262.2   1.00e+08

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}ibc {c |}{res}    160,738     1204826     1534788          0   5.13e+07

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}pension {c |}{res}    160,738    .7345929    .4415511          0          1
{txt}
{com}. 
. 
. 
. 
. 
. ** RIPS
. use if (poblacion_M50 == 1 | poblacion_F55 == 1) using              ///
>        "${c -(}data{c )-}/Estimation_sample_RIPS.dta", clear
{txt}
{com}. 
. rename (nro_serviciosHospitalizacion nro_serviciosurgencias                     ///
>     nro_serviciosprocedimientos nro_serviciosconsultas estres_laboral)          ///
>     (nro_Hospitalizacion nro_urgencias nro_procedimientos nro_consultas         ///
>     estreslaboral)
{res}{txt}
{com}.     
. egen nro_servicios = rowtotal(nro_Hospitalizacion nro_urgencias         ///
>     nro_procedimientos nro_consultas)
{txt}
{com}.        
. collapse (sum) nro* (max) $extensive   ///
>          (firstnm) poblacion*, by(personabasicaid)
{res}{txt}
{com}. 
. rename (nro_servicios nro_consultas nro_procedimientos nro_urgencias    ///
>         nro_Hospitalizacion) (servicios consultas proced urgencias hospits)
{res}{txt}
{com}.   
. local coh "M"
{txt}
{com}. foreach cohort in M50 F55 {c -(}
{txt}  2{com}.     
.     foreach outcome in servicios consultas proced urgencias hospits {c -(}
{txt}  3{com}.         
.         if inlist("`outcome'", "urgencias", "hospits") {c -(}
{txt}  4{com}.             local rounded "round(1)"
{txt}  5{com}.         {c )-}
{txt}  6{com}.         else{c -(}
{txt}  7{com}.             local rounded "round(0)"
{txt}  8{com}.         {c )-}
{txt}  9{com}.         
.         sum `outcome' if poblacion_`cohort' == 1
{txt} 10{com}.         local m_`outcome'_`cohort'   : di %10.3fc r(mean)
{txt} 11{com}.         local sd_`outcome'_`cohort'  : di %10.3fc r(sd)
{txt} 12{com}.         local min_`outcome'_`cohort' : di %10.3fc r(min)
{txt} 13{com}.         _pctile `outcome' if poblacion_`cohort' == 1, p(99)
{txt} 14{com}.         local max_`outcome'_`cohort' : di %13.0fc r(r1)
{txt} 15{com}.         
.         local `outcome'_`cohort' = strtrim("`: di r(mean)'")
{txt} 16{com}.     
.         texresults3 using "${c -(}tables{c )-}/numbers.txt", texmacro(`outcome'`coh')  ///
>         result(``outcome'_`cohort'') append `rounded'
{txt} 17{com}.     {c )-}
{txt} 18{com}.     local coh "F"
{txt} 19{com}. {c )-}

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}servicios {c |}{res}    158,648    118.2084     126.554          1       4189

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}consultas {c |}{res}    158,648     40.5234    40.91812          0       1554

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}proced {c |}{res}    158,648    75.79748    95.01357          0       3106

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}urgencias {c |}{res}    158,648    1.302853    2.659625          0        102

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}hospits {c |}{res}    158,648    .5846654    1.572571          0         87

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}servicios {c |}{res}    156,460    139.9723    127.7673          1       2517

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}consultas {c |}{res}    156,460    52.61601    46.66012          0       1893

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}proced {c |}{res}    156,460    85.66452    90.15212          0       2111

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}urgencias {c |}{res}    156,460    1.271597     2.72467          0        197

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}hospits {c |}{res}    156,460    .4202032    1.385312          0         75
{txt}
{com}. 
. 
. local coh "M"
{txt}
{com}. foreach cohort in M50 F55 {c -(}
{txt}  2{com}.     
.     foreach outcome in $extensive {c -(}
{txt}  3{com}.         
.         sum `outcome' if poblacion_`cohort' == 1
{txt}  4{com}.         local m_`outcome'_`cohort'   : di %10.3fc r(mean)
{txt}  5{com}.         local sd_`outcome'_`cohort'  : di %10.3fc r(sd)
{txt}  6{com}.         local min_`outcome'_`cohort' : di %10.0fc r(min)
{txt}  7{com}.         local max_`outcome'_`cohort' : di %10.0fc r(max)
{txt}  8{com}.         
.         local `outcome'_`cohort' = r(mean)*100
{txt}  9{com}. 
.         texresults3 using "${c -(}tables{c )-}/numbers.txt", texmacro(`outcome'`coh')  ///
>         result(``outcome'_`cohort'') append round(1)
{txt} 10{com}.     {c )-}
{txt} 11{com}.     local coh "F"
{txt} 12{com}. {c )-}

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}service {c |}{res}    158,648           1           0          1          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}consul {c |}{res}    158,648    .9876015    .1106565          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}proce {c |}{res}    158,648     .969322    .1724443          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}urg {c |}{res}    158,648    .4568542    .4981365          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}hosp {c |}{res}    158,648    .2791967    .4486058          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
cardiovasc~r {c |}{res}    158,648    .0597927    .2371032          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
estreslabo~l {c |}{res}    158,648    .0011976     .034586          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}msk {c |}{res}    158,648    .5986524    .4901726          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}service {c |}{res}    156,460           1           0          1          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}consul {c |}{res}    156,460    .9914803    .0919087          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}proce {c |}{res}    156,460    .9846287     .123025          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}urg {c |}{res}    156,460    .4436405     .496815          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}hosp {c |}{res}    156,460    .2068516    .4050495          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
cardiovasc~r {c |}{res}    156,460    .0246389    .1550225          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
estreslabo~l {c |}{res}    156,460    .0033747    .0579939          0          1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}msk {c |}{res}    156,460    .7521475    .4317671          0          1
{txt}
{com}. 
. gen wage    = .
{txt}(315,108 missing values generated)

{com}. gen ibc     = .
{txt}(315,108 missing values generated)

{com}. gen pension = .
{txt}(315,108 missing values generated)

{com}. 
. labvars $all_outcomes                                                            ///
>     "Monthly real wage" "Pension proxy"                                          ///
>     "Number of services" "Number of consultations" "Number of procedures"        ///
>     "Number of ER visits" "Number of hospitalizations" "Any service" "Consulted" ///
>     "Procedures" "Visited ER" "Hospitalized" "Cardiovascular"                    ///
>     "Work-related stress" "Musculoskeletal disease"
{txt}
{com}. 
. * LaTex table
. texdoc init "${c -(}tables{c )-}/summary_stats.tex", replace force
{res}{txt}(texdoc output file is Z:/Christian Posso/_banrep_research/proyectos/pensions/Tables\summary_stats.tex)
{res}{txt}
{com}. 
. tex \begin{c -(}tabular{c )-}{c -(}lcccccccc{c )-}
{res}{txt}
{com}. tex \toprule
{res}{txt}
{com}. 
. tex & \multicolumn{c -(}4{c )-}{c -(}c{c )-}{c -(}M50{c )-} & \multicolumn{c -(}4{c )-}{c -(}c{c )-}{c -(}F55{c )-} \\
{res}{txt}
{com}. tex \cmidrule(l){c -(}2-5{c )-} \cmidrule(l){c -(}6-9{c )-}
{res}{txt}
{com}. 
. tex & Mean & SD & Min & Max & Mean & SD & Min & Max \\
{res}{txt}
{com}. tex \midrule
{res}{txt}
{com}. 
. 
. 
. local i = 1
{txt}
{com}. local j = 1
{txt}
{com}. foreach var of global all_outcomes {c -(}
{txt}  2{com}.     
.     local w: variable label `var'
{txt}  3{com}.     
.     if `i' == 1       local panel "tex \multicolumn{c -(}9{c )-}{c -(}l{c )-}{c -(}\textit{c -(}Panel A: Labor market{c )-}{c )-} \\"
{txt}  4{com}.     else if `i' == 3  local panel "tex \multicolumn{c -(}9{c )-}{c -(}l{c )-}{c -(}\textit{c -(}Panel B: Health{c )-}{c )-} \\"
{txt}  5{com}.     else              local panel
{txt}  6{com}. 
.     if `j' == 2       local space "\addlinespace"
{txt}  7{com}.     else              local space
{txt}  8{com}.     
.     
.     `panel'
{txt}  9{com}.     tex `w' & `m_`var'_M50' & `sd_`var'_M50' & `min_`var'_M50' & `max_`var'_M50' & `m_`var'_F55' & `sd_`var'_F55' & `min_`var'_F55' & `max_`var'_F55' \\ `space'
{txt} 10{com}. 
.     local ++i
{txt} 11{com}.     local ++j
{txt} 12{com}. {c )-}
{res}{txt}
{com}. 
. tex \midrule
{res}{txt}
{com}. tex Observations & \multicolumn{c -(}4{c )-}{c -(}c{c )-}{c -(}`m50_n'{c )-} & \multicolumn{c -(}4{c )-}{c -(}c{c )-}{c -(}`f55_n'{c )-} \\
{res}{txt}
{com}. 
. tex \bottomrule
{res}{txt}
{com}. tex \end{c -(}tabular{c )-}
{res}{txt}
{com}. texdoc close
{txt}(texdoc output written to {browse `"Z:/Christian Posso/_banrep_research/proyectos/pensions/Tables\summary_stats.tex"':Z:/Christian Posso/_banrep_research/proyectos/pensions/Tables\summary_stats.tex})
{res}{txt}
{com}. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}Z:/Christian Posso/_banrep_research/proyectos/pensions/Logs/Summary stats.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Sep 2025, 15:58:25
{txt}{.-}
{smcl}
{txt}{sf}{ul off}